Revit 2027 API
DuplicateTypeNamesHandlerArgs.Document Property
 The document that contains the types with duplicate names.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document Document { get; }
Public ReadOnly Property Document As Document
	Get
public:
property Document^ Document {
	Document^ get ();
}
member Document : Document with get
Property Value
Document
See Also
Reference
DuplicateTypeNamesHandlerArgs Class
Autodesk.Revit.DB Namespace